[{"name": "DevOps", "description": "Надежность работы банковских систем и счастье разработчиков лежит на плечах DevOps-специалистов. Они отвечают за автоматизацию процессов разработки, тестирования и релизов, помогают настраивать мониторинг, внедряют CI/CD и знают, как работают операционные системы и базы данных. Если у вас есть опыт написание скриптов на Python и/или bash и вам интересно это направление, приглашаем принять участие в стажировке. Расскажите о своих интересах и опыте в личном кабинете в поле «Пара слов о себе». Подробнее об этом поговорим на собеседовании в случае успешного прохождения онлайн-экзамена.", "exams": "анкета, программирование, тест по администрированию", "places": "5 мест"}, {"name": "Технический писатель", "description": "Технический писатель составляет документацию по сервису, чтобы смежные команды с легкостью могли понять возможности и процесс интеграции с выбранным внутри компании решением. Этот человек обладает аналитическим складом ума, готов разбираться в архитектуре и логике работы продуктов, систематизировать и унифицировать накопленную информацию. Умение писать базовые SQL запросы будет плюсом. Подробнее об этом поговорим на собеседовании в случае успешного прохождения онлайн-экзамена. Заполните в личном кабинете поле «Пара слов о себе», чтобы мы подготовились.", "exams": "анкета, тест на SQL", "places": "1 место"}, {"name": "Аналитик-разработчик SQL", "description": "Аналитики-разработчики SQL, или системные аналитики, участвуют в формировании модели данных, систематизируют анализ источников данных и проводят анализ бизнес-процессов. Формулируют ТЗ и спецификации для разработчиков и развивают хранилище. Для каждого участника свой проект. Например, настройка процессов обработки больших данных, оптимизация существующих методов. В работе вам потребуется уверенное владение SQL. Если вы умеете программировать, то хорошо разобраться с ним можнопримерно за три вечера, решая задачки на www.sql-ex.ru. В случае успешной сдачи онлайн-экзаменов предстоит собеседование с куратором. Заполните в личном кабинете поле «Пара слов о себе», чтобы мы подготовились.", "exams": "анкета, программирование, тест на SQL", "places": "9 мест"}, {"name": "Аналитик", "description": "Аналитики много и эффективно работают головой, штурмуют проблемы, выдвигают гипотезы, тестируют их и делают так, чтобы все работало правильно. Для каждого участника стажировки свой проект. Например, проанализировать паттерны потребления услуг в мобильном операторе, улучшить модель для прогнозирования открытых счетов, создать модель загрузки персональных менеджеров в отделе малого и среднего бизнеса. Кроме хороших математических навыков и высоких аналитических способностей, нужны целеустремленность и умение доводить дело до конца. Победы в школьных и студенческих олимпиадах, опыт работы с Python и машинным обучением будут плюсом, расскажите о них в личном кабинете в поле «Пара слов о себе». В случае успешной сдачи онлайн-экзаменов предстоит собеседование с куратором о ваших учебных проектах и интересах.", "exams": "анкета, математика", "places": "53 места"}, {"name": "Machine Learning Engineer", "description": "Специалисты в машинном обучении реализуют и внедряют алгоритмы в области анализа и синтеза речи, анализа текстов, рекомендательных систем, анализа временных рядов, обработки видео и изображений. Они участвуют в командной разработке продуктов, находят и адаптируют state-of-the-art модели, оптимизируют существующие алгоритмы. Для каждого участника стажировки свой проект. Например, разработка рекомендательной системы для кандидатов в операционных подразделениях, тестовая аналитика звонков, анализ категорий покупок клиентов, улучшение существующих диалоговых систем, дедубликация компаний, анализ использования конструктора сайта для малого и среднего бизнеса. В случае успешной сдачи онлайн-экзаменов предстоит собеседование по машинному обучению и анализу данных. В личном кабинете в разделе «Пара слов о себе» расскажите нам о победах в олимпиадах, участии в конкурсах на Kaggle, опыте в ML и DL и использовании библиотек. Если пока у вас только теоретические знания в ML, выберите поток аналитиков.", "exams": "анкета, программирование, математика", "places": "22 места"}, {"name": "Разработчик бизнес-процессов", "description": "В инфраструктуре компании мы используем BPM-системы (Business Process Management). Это мощная основа для реализации сложных интеграций и бизнес-логики. Мы предлагаем интересные задачи с нетривиальными решениями, возможность расширить свой технический кругозор. Мы ждем, что вы хорошо владеете языком программирования (желательно Java), опыт работы с базами данных и знание SQL будет плюсом. Подробнее об этом поговорим на собеседовании в случае успешного прохождения онлайн-экзамена. Заполните в личном кабинете поле «Пара слов о себе», чтобы мы могли подготовиться.", "exams": "анкета, программирование, тест на SQL", "places": "9 мест"}, {"name": "C# разработчик", "description": "Чтобы разрабатывать передовые финтех-продукты, внутренние процессы должны работать, как часы. Ищем C#-разработчиков для обслуживания и маршрутизации запросов на внутренних платформах Tinkoff.ru Мы ждем, что вы владеете С#, знание SQL и JavaScript будет плюсом. О наличии учебных проектов расскажите в личном кабинете в поле «Пара слов о себе». Подробнее о них спросим на собеседовании в случае успешного прохождения онлайн-экзамена.", "exams": "анкета, программирование", "places": "3 места"}, {"name": "C# разработчик-исследователь", "description": "Есть несколько проектов для разработчиков-исследователей на C#: исследование наличия синтезированной речи в звуковых сигналах и разработка модели принятия решений о качестве обслуживания. Мы ждем, что у вас есть некоторый опыт промышленной разработки и знание базовых ML алгоритмов. В личном кабинете в поле «Пара слов о себе» расскажите все, что считаете нужным о своем опыте. Подробнее об этом поговорим на собеседовании в случае успешного прохождения онлайн-экзамена.", "exams": "анкета, программирование, математика", "places": "3 места"}, {"name": "Олимпиадный программист", "description": "Для человека с успехами в олимпиадном программировании предлагаем задачу автоматического распределения встреч команды представителей. Нужно будет изучить существующий алгоритм, понять его недостатки, провести исследование современных методов подобных задач и найти подходящую модель. Опыт промышленной разработки и использования SQL будет плюсом, но гибкость ума и желание решать сложные задачи играет для нас ключевую роль. В личном кабинете в разделе «Пара слов о себе» расскажите нам о победах в олимпиадах, своих учебных проектах и интересах, поговорим об этом на собеседовании в случае успешного прохождения онлайн-экзамена. Выбор языка программирования для решения контеста оставляем на ваше усмотрение.", "exams": "анкета, программирование", "places": "1 место"}, {"name": "Python-разработчик", "description": "Python – это не только язык для анализа данных. На нем, например, написан этот сайт образовательных программ. Проекты в этой категории меньше про математику и больше про веб-разработку и инфраструктурные системы. Для каждого участника стажировки свой проект, некоторые предполагают работу в парах. Примеры проектов: разработка платформы для проведения матбоев, построение деревьев оптимальных стратегий, доработка существующих сервисов по управлению процессами компании. Мы ждем, что вы уверенно владеете Python, опыт frontend-разработки и работы с базами данных будет плюсом. Расскажите об этом в личном кабинете в поле «Пара слов о себе». Подробнее поговорим на собеседовании в случае успешного прохождения онлайн-экзамена.", "exams": "анкета, программирование", "places": "5 мест"}, {"name": "Java-разработчик", "description": "Java-разработчики занимаются сложными и интересными задачами: реогранизацией тестовой модели приложения, оптимизацией интеграционных решений внутри Tinkoff.ru, решением NP-полной оптимизационной задачи и многими другими. Также они реализуют прототипы, вырастающие в полноценные проекты. Мы ждем, что вы владеете Java на начальном уровне, использование Spring Framework и знание SQL будет плюсом. О наличии учебных проектов и своем опыте расскажите в личном кабинете в поле «Пара слов о себе». Подробнее об этом спросим на собеседовании в случае успешного прохождения онлайн-экзамена.", "exams": "анкета, программирование", "places": "13 мест"}, {"name": "iOS-разработчик", "description": "Tinkoff.ru создаёт лучшие мобильные приложения в банковском сегменте, нашими продуктами пользуются сотни тысяч клиентов ежедневно. Предлагаем попробовать свои силы в развитии клиентского проекта в качестве iOS-разработчика. Мы ждем, что вы уверенно владеете Swift, наличие реализованных проектов будет плюсом. Расскажите о них в личном кабинете в поле «Пара слов о себе». Подробнее об этом поговорим на собеседовании в случае успешного прохождения онлайн-экзамена.", "exams": "анкета, тест по iOS, лабораторная работа, программирование", "places": "1 место"}, {"name": "Разработчик бизнес-процессов", "description": "В инфраструктуре компании мы используем BPM-системы (Business Process Management). Это мощная основа для реализации сложных интеграций и бизнес-логики. Мы предлагаем интересные задачи с нетривиальными решениями, возможность расширить свой технический кругозор. Мы ждем, что вы хорошо владеете языком программирования (желательно Java), опыт работы с базами данных и знание SQL будет плюсом. Подробнее об этом поговорим на собеседовании в случае успешного прохождения онлайн-экзамена. Заполните в личном кабинете поле «Пара слов о себе», чтобы мы могли подготовиться.", "exams": "анкета, программирование, тест на SQL", "places": "9 мест"}, {"name": "Frontend-разработчик", "description": "Frontend-разработчики отвечают за опыт взаимодействия клиентов с нашими продуктами и решают нетривиальные задачи каждый день: как обеспечить кроссплатформенность, как организовать быструю работу сайта с множеством сложнейших элементов, как сделать интерфейс удобным и функциональным. Для позиции необходимы базовые знания в JavaScript, HTML, CSS, опыт работы с Python и учебные проекты на Github будут плюсом. Расскажите об этом в личном кабинете в поле «Пара слов о себе». Подробнее обсудим на собеседовании в случае успешного прохождения онлайн-экзамена.", "exams": "анкета, программирование", "places": "11 мест"}, {"name": "Scala-разработчик", "description": "Компания Tinkoff.ru собрала внутри себя самое большое сообщество Scala разработчиков в России (более 80 профессионалов) и накопила уникальный опыт запуска бекендов на этом стеке технологий. Приглашаем присоединиться к проекту разработки кластера по работе с большими данными, который используют все аналитики компании. Мы ждем ребят с живым умом и гибкой логикой, которые хотят изучать Scala. Необходимо знание хотя бы одного языка программирования. Победы в школьных и студенческих олимпиадах, хакатонах, опыт в Java или Scala-разработке или пройденный курс на Coursera по Scala будут плюсом. Расскажите о ваших достижениях в личном кабинете в поле «Пара слов о себе». Подробнее об этом поговорим на собеседовании в случае успешного прохождения онлайн-экзамена.", "exams": "анкета, программирование", "places": "1 место"}, {"name": "Автоматизатор тестирования Java", "description": "Автоматизаторы тестирования – это специалисты на стыке разработки и тестирования. Они создают решения для автоматизированного тестирования API, мобильных приложений и внутренних систем. Важная часть работы – сопровождение функционального и нагрузочного тестирования: здесь разрабатывают сценарии и скрипты, проводят сбор и анализ результатов, формируют отчеты. Для этого направления необходимо знание любого языка программирования (желательно Java). В случае успешной сдачи онлайн-экзаменов предстоит собеседование с куратором о ваших учебных проектах и интересах. Заполните в личном кабинете поле «Пара слов о себе», чтобы мы подготовились.", "exams": "анкета, программирование, проверка навыков тестирования", "places": "3 места"}, {"name": "Разработчик бизнес-правил", "description": "Разработчик бизнес-правил общается с заказчиками внутри компании, выявляет их потребности и фиксирует их в системе IBM ODM (ничего страшного, если вы не сталкивались с ней ранее). После он проводит анализ существующих процессов и старается их оптимизировать. Для этого направления понадобится Java, знание SQL будет плюсом. Подробнее поговорим на собеседовании в случае успешного прохождения онлайн-экзамена. Заполните в личном кабинете поле «Пара слов о себе», чтобы мы могли подготовиться.", "exams": "анкета, программирование, тест на SQL", "places": "4 места"}, {"name": "Функциональный тестировщик", "description": "Мы работаем с продуктами, которые должны выполнять свои функции с гарантированным уровнем качества — любая ошибка стоит очень дорого. Поэтому работа тестировщика становится одной из важнейших специальностей на рынке. Тестировщики готовят сценарии и прорабатывают тест-кейсы, анализируют функционал приложений на наличие слабых мест, проводят ручное функциональное тестирование веб-сервисов. Опыта программирования не требуется, понимание работы веб-сервисов, знания баг-трекинговых систем будет плюсом. Подробнее об этом поговорим на собеседовании в случае успешного прохождения онлайн-экзамена. Заполните в личном кабинете поле «Пара слов о себе», чтобы мы подготовились.", "exams": "анкета, проверка навыков тестирования", "places": "7 мест"}]